
{
    "button-lunch webside": "btn-l",
    "button_back": "Back",



    "link_start": "Welcome",
    "link_about": "About me",
    "link_project": "Project",
    "link_skills": "Skills",
    "link_testiomonials": "Testimonial",
    "link_contact": "Contact",


    "text_welcom": "Welcome !",
    "text_toMy": "to my",
    "porfolio": "portfolio" ,
    "passionate": "Passionate, creative and attentive",
    "web_developpeur": "Web and Mobile Developer",

    "about": "About Me",
    "my_name": "My name is Anna Stelmach",
    "desciptionTitle1_about": "👋 Hello! I'm Anna, your Web Developer!",
    "desciption1_about": "After 15 years of experience in the fashion industry and a decade leading stores, I embarked on an exciting career change that led me to web development. Today, I'm here to help you bring your online projects to life with expertise and dedication.",
    "desciptionTitle2_about": "📚 Certified Expertise, Personalized Service:",
    "desciption2_about": "With a certified RNCP web developer diploma, I combine technical proficiency with outstanding customer service. Each project is approached with dedication and professionalism, guaranteeing you a bespoke and high-quality solution.",
    "desciptionTitle3_about": "🏆 Showcase or E-commerce, Your Online Success Starts Here:",
    "desciption3_about": "Whether you aim to present your business with elegance or sell your products online, I'm here to bring your vision to life. With expert proficiency in crafting showcase and e-commerce sites, I assist you in reaching your online objectives.",
    "desciptionTitle4_about": "📈 A Site that Grows with You:",
    "desciption4_about": "Your website will not only serve as a marketing tool but also as a partner in your business growth. With scalable features and flexible architecture, your site will be prepared to grow alongside your business.",
    "desciptionTitle5_about": "🌟 A Memorable User Experience:",
    "desciption5_about": "I prioritize user-friendliness and aesthetics to provide your visitors with a seamless and engaging experience. Each element of your site will be meticulously crafted to capture attention and drive action",
    "desciptionTitle6_about": "🤝 Ready to Take Action?",
    "desciption6_about": "Get in touch with me today to discuss your website project! Together, we can craft an online presence that sets you apart from the competition and captivates your potential clients.",

    "project":  "Projects",
    "date1_project": "December 2022 - January 2023",
    "date2_project": "January 2023 - May 2023",


    "text_1":  "I love coding.",
    "text_2": "Building Digital Dreams, One Line at a Time.",
    "text_3": "I'm eager to bring my passion and determination to contribute to the success of your project.",

    "contact_apelle": "Call me!",
    "chez_moi": "At my place",
    "text_motivation": "As a passionate developer, my mission is to craft tailored solutions that not only meet your needs, but also exceed your expectations. With a collaborative approach and a fervor for innovation, I'm here to guide you through every step of your project. Together, we can turn your ideas into triumphs. Let's team up and create something extraordinary! Get in touch with me.",


    "title_onejitsu": "Backoffice for the OneJitsu application",
    "p1_onejitsu": "Currently engaged by the creator of the Onjitsu application, I am working solo on creating the desktop mode backoffice of the application. Due to confidentiality, specific details cannot be disclosed, but I am passionate about this significant challenge.",
    "p2_onejitsu": "This mission involves enabling club managers to efficiently manage their clubs, the profiles of their members, create events, classes, and news, as well as modify contact details and schedules. The interface also allows interaction with the number of clubs.",
    "p3_onejitsu":  "The application's backend is naturally managed by Firestore.",
    "skills-onejitsu": "Skills",

    
    "title_quiAntique": "Restaurant Quai Antique",
    "p1_quaiAntique": "This project was a <span class=\"fw-bolder text-fort\"> significant challenge</span> for me, undertaken as part of my final exam to obtain the Web Developer diploma. It is a comprehensive application with both <span class=\"fw-bolder text-fort\">frontend and backend</span> interfaces, accompanied by an<span class=\"fw-bolder text-fort\"> administrator's backoffice</span>. I dedicated five months to its completion, and this project provided me with a tangible insight into the developer's profession.",
    "p2_quaiAntique": "For its realization, I chose to use <span class=\"fw-bolder text-fort\">React.js and Node.js</span>, as they were the technologies I was most proficient in. I began by designing <span class=\"fw-bolder text-fort\">all screens</span>, both for <span class=\"fw-bolder text-fort\">desktop and mobile, using Figma</span>, allowing me to visualize my site. Following this, I created use case <span class=\"fw-bolder text-fort\"> diagrams and a conceptual data model (CDM)</span> to understand and define the database and site functionalities.",
    "p3_quaiAntique": "The development started with the creation of a <span class=\"fw-bolder text-fort\">component communicating with my database through SQL queries</span>. I developed my <span class=\"fw-bolder text-fort\">RESTful API with Express.js</span> and the <span class=\"fw-bolder text-fort\">frontend based on my mock-ups</span>.<br> <span class=\"text-decoration-underline\">The visual aspect of this project took a backseat to the functionalities it offered.</span>",
    "p4_quaiAntique": "Users can <span class=\"fw-bolder text-fort\">register, log in, reserve a table, and the administrator, through the backoffice, can modify practically everything on the site</span>. While this project presented a considerable <span class=\"fw-bolder text-fort\">challenge</span>, it was highly <span class=\"fw-bolder text-fort\">educational</span>. It also sparked a commitment to continuous improvement and a realization that <span class=\"fw-bolder text-fort\">there is still much for me to learn</span> and refine in my journey as a developer. I continue to enhance it, as there is much more to do.",
    
    "title_coeur": "Association Coeur sur la main",
    "p1_coeur": "This was my very first website project that I started in October 2022 and took me a month to complete.",
    "p2_coeur": "It was a frontend project and part of an individual gig during my Studi school days. Looking back, I realize how basic it is, but you know what they say - never forget your roots! <br>to remember where you started!",
    "p3_coeur": "This project allows me to become aware of the progress I've made in a short time in the field of programming."
}