{
    "button-lunch webside": "btn-l",
    "button_back": "Back",
    "skills": "Slills",
    "link_start": "Welcome",
    "link_about": "About me",
    "link_prestations": "Services",
    "link_project": "Project",
    "link_skills": "Skills",
    "link_testiomonials": "Testimonial",
    "link_contact": "Contact",
    "text_welcom": "Welcome !",
    "text_toMy": "to my",
    "porfolio": "website",
    "passionate": "Passionate, creative and attentive",
    "web_developpeur": "Web Designer & Website Creator",
    "about": "About Me",
    "my_name": "My name is Anna ",
    "desciptionTitle1_about": " Hello! I'm Anna, your Web Developer!",
    "desciption1_about": "With a 5-year passion for web development and previous experience as a head manager in the ready-to-wear industry, I've embarked on a journey to pursue my passion: crafting bespoke e-commerce websites, showcase websites, and web applications.",
    "desciptionTitle2_about": " Certified Expertise, Personalized Service:",
    "desciption2_about": "With a certified RNCP web developer diploma, I combine technical proficiency with outstanding customer service. Each project is approached with dedication and professionalism, guaranteeing you a bespoke and high-quality solution.",
    "desciptionTitle3_about": " Showcase or E-commerce, Your Online Success Starts Here:",
    "desciption3_about": "Whether you aim to present your business with elegance or sell your products online, I'm here to bring your vision to life. With expert proficiency in crafting showcase and e-commerce sites, I assist you in reaching your online objectives.",
    "desciptionTitle4_about": "📈 A Site that Grows with You:",
    "desciption4_about": "Your website will not only serve as a marketing tool but also as a partner in your business growth. With scalable features and flexible architecture, your site will be prepared to grow alongside your business.",
    "desciptionTitle5_about": " A Memorable User Experience:",
    "desciption5_about": "I prioritize user-friendliness and aesthetics to provide your visitors with a seamless and engaging experience. Each element of your site will be meticulously crafted to capture attention and drive action",
    "desciptionTitle6_about": " Enhanced SEO and Targeted SEA Campaigns:",
    "desciption6_about": "I'm dedicated to optimizing your online visibility through thorough SEO optimization and targeted SEA campaigns, using industry best practices and cutting-edge techniques. Together, we'll devise an effective strategy to boost your online presence and drive conversions.",
    "desciptionTitle7_about": " Ready to Take Action?",
    "desciption7_about": "Get in touch with me today to discuss your website project! Together, we can craft an online presence that sets you apart from the competition and captivates your potential clients.",
    "desciptionTitle1_pousse": "For more advanced projects",
    "desciption1_pousse": "I collaborate with the project manager and a PHP developer (Symfony) to ensure an optimal outcome and find effective solutions to the technical challenges and project requirements.",
    "prestations": "Services",
    "project": "Projects",
    "date1_project": "",
    "date2_project": "",
    "text_1": "I love coding.",
    "text_2": "Building Digital Dreams, One Line at a Time.",
    "text_3": "I'm eager to bring my passion and determination to contribute to the success of your project.",
    "contact_apelle": "Call me!",
    "chez_moi": "At my place",
    "text_motivation": "As a passionate developer, my mission is to craft tailored solutions that not only meet your needs, but also exceed your expectations. With a collaborative approach and a fervor for innovation, I'm here to guide you through every step of your project. Together, we can turn your ideas into triumphs. Let's team up and create something extraordinary! Get in touch with me.",
    "title_onejitsu": "Backoffice for the OneJitsu application",
    "p1_onejitsu": "Currently engaged by the creator of the Onjitsu application, I am working solo on creating the desktop mode backoffice of the application. Due to confidentiality, specific details cannot be disclosed, but I am passionate about this significant challenge.",
    "p2_onejitsu": "This mission involves enabling club managers to efficiently manage their clubs, the profiles of their members, create events, classes, and news, as well as modify contact details and schedules. The interface also allows interaction with the number of clubs.",
    "p3_onejitsu": "The application's backend is naturally managed by Firestore.",
    "skills-onejitsu": "Skills",
    "title_quiAntique": "Restaurant Quai Antique",
    "p1_quaiAntique": "This project was a <span class=\"fw-bolder text-fort\"> significant challenge</span> for me, undertaken as part of my final exam to obtain the Web Developer diploma. It is a comprehensive application with both <span class=\"fw-bolder text-fort\">frontend and backend</span> interfaces, accompanied by an<span class=\"fw-bolder text-fort\"> administrator's backoffice</span>. I dedicated five months to its completion, and this project provided me with a tangible insight into the developer's profession.",
    "p2_quaiAntique": "For its realization, I chose to use <span class=\"fw-bolder text-fort\">React.js and Node.js</span>, as they were the technologies I was most proficient in. I began by designing <span class=\"fw-bolder text-fort\">all screens</span>, both for <span class=\"fw-bolder text-fort\">desktop and mobile, using Figma</span>, allowing me to visualize my site. Following this, I created use case <span class=\"fw-bolder text-fort\"> diagrams and a conceptual data model (CDM)</span> to understand and define the database and site functionalities.",
    "p3_quaiAntique": "The development started with the creation of a <span class=\"fw-bolder text-fort\">component communicating with my database through SQL queries</span>. I developed my <span class=\"fw-bolder text-fort\">RESTful API with Express.js</span> and the <span class=\"fw-bolder text-fort\">frontend based on my mock-ups</span>.<br> <span class=\"text-decoration-underline\">The visual aspect of this project took a backseat to the functionalities it offered.</span>",
    "p4_quaiAntique": "Users can <span class=\"fw-bolder text-fort\">register, log in, reserve a table, and the administrator, through the backoffice, can modify practically everything on the site</span>. While this project presented a considerable <span class=\"fw-bolder text-fort\">challenge</span>, it was highly <span class=\"fw-bolder text-fort\">educational</span>. It also sparked a commitment to continuous improvement and a realization that <span class=\"fw-bolder text-fort\">there is still much for me to learn</span> and refine in my journey as a developer. I continue to enhance it, as there is much more to do.",
    "title_coeur": "Association Coeur sur la main",
    "p1_coeur": "This was my very first website project that I started in October 2022 and took me a month to complete.",
    "p2_coeur": "It was a frontend project and part of an individual gig during my Studi school days. Looking back, I realize how basic it is, but you know what they say - never forget your roots! <br>to remember where you started!",
    "p3_coeur": "This project allows me to become aware of the progress I've made in a short time in the field of programming.",
    "title_Sama": "Design and creation of a website for a naturopath",
    "p1_Sama": "I was in charge of creating and developing a website for a naturopath.",
    "p2_Sama": "The main goal was to create a platform that faithfully reflected her values, personal tastes, and unique approach to natural health.",
    "p3_Sama": "Every element of the site was designed to be a reflection of her image, as this was the most important aspect: providing an online experience that harmonizes with her philosophy and practice.",
    "title_Built": "Website for Built Assets",
    "p1_Built": "I was hired by Built Assets, a large dynamic company specializing in the sectors of construction, consulting, real estate, and energy solutions in Togo. Working closely with them, I leveraged my skills and expertise to design this project from A to Z, entirely tailored to their needs. The challenge was to construct the website effectively to showcase their numerous services and prestigious clients",
    "li_title_projet": "Project Objective:",
    "li_concevoir": "Design and develop a professional website for Built Assets to promote its services and enhance its online presence.",
    "li_title_portee": "Project Scope:",
    "li_portee_creation": "Create a responsive and visually appealing website that showcases Built Assets' areas of expertise, including construction, consulting, real estate, and energy solutions.",
    "li_portee_integration": "Integrate interactive features to provide an optimal user experience.",
    "li_portee_optimisation": "Optimize the site for search engines (SEO) to increase online visibility and attract more potential clients.",
    "li_portee_colaboration": "Collaborate closely with Built Assets' team to ensure the site accurately reflects the company's image and meets its specific needs.",
    "li_title_etapes": "Project Phases:",
    "li_etapes_p1": "Analyze the company's needs and goals, define site features and architecture.",
    "li_etapes_p2": "Graphic design and creation of mockups for approval.",
    "li_etapes_p3": "Website development using best practices in web development and design.",
    "li_etapes_p4": "Content integration, testing, and validation with Built Assets' team.",
    "li_etapes_p5": "Website deployment and training for content management.",
    "li_title_echeance": "Timeline:",
    "li_echeance": "Project Duration: 3 months",
    "li_title_livrables": "Deliverables:",
    "li_livrables_functionnel": "Fully functional and optimized website",
    "li_livrables_formation": "Training for Built Assets' team on website management",
    "title_Mondial": "Website for Mondial 2 Roues",
    "p1_Mondial": " I was engaged by Mondial 2 Roues, formerly known as Mondial City, a leading company in the sale and repair of motorcycles and scooters. Working closely with the two owners, I designed and developed a modern and efficient website to showcase their extensive range of products and services. The primary goal was to create an intuitive platform that appeals to two-wheeler enthusiasts while providing a smooth and enjoyable shopping experience.",
    "li_title_projet_Mondial": "Project Objective:",
    "li_concevoir_Mondial": "Design and develop a professional website for Mondial 2 Roues to promote their products and services while strengthening their online presence.",
    "li_title_portee_Mondial": "Project Scope:",
    "li_portee_creation_Mondial": "Create a responsive, visually appealing, and easy-to-navigate website highlighting the range of motorcycles, scooters, and accessories available at Mondial 2 Roues.",
    "li_portee_integration_Mondial": "Integrate a product catalog with filtering options to enhance the user experience.",
    "li_portee_optimisation_Mondial": "Optimize the site for search engines (SEO) to increase online visibility and attract more potential customers.",
    "li_portee_colaboration_Mondial": "Work closely with the owners of Mondial 2 Roues to ensure the site accurately reflects their brand and meets their specific needs.",
    "li_title_etapes_Mondial": "Project Steps:",
    "li_etapes_p1_Mondial": "Analyze the company's needs and define the necessary features for the site.",
    "li_etapes_p2_Mondial": "Create graphic designs and mockups, focusing on user experience and aesthetics.",
    "li_etapes_p3_Mondial": "Develop the website using best practices in web development and UX/UI design.",
    "li_etapes_p4_Mondial": "Integrate the product catalog and services, conducting rigorous testing to ensure a smooth experience across all devices.",
    "li_etapes_p5_Mondial": "Launch the website and provide training to the owners of Mondial 2 Roues on content management and site administration.",
    "li_title_echeance_Mondial": "Timeline:",
    "li_echeance_Mondial": "Project duration: 2 months",
    "li_title_livrables_Mondial": "Deliverables:",
    "li_livrables_functionnel_Mondial": "Fully functional, optimized website ready for online business.",
    "li_livrables_formation_Mondial": "Training for the owners of Mondial 2 Roues on managing the website and adding new products.",
    "li_title_collaboration_Mondial": "Ongoing Collaboration:",
    "title_seo_sea_Mondial": "Advanced SEO Optimization and SEA Campaigns for Mondial 2 Roues",
    "p1_seo_sea_Mondial": "After completing the website, I was brought on to continue optimizing the SEO and to implement SEA (Search Engine Advertising) campaigns. The goal was to enhance the online visibility of Mondial 2 Roues and attract more potential customers.",
    "li_title_seo_Mondial": "Advanced SEO Optimization:",
    "li_seo_audit_Mondial": "Conducting a thorough audit to identify opportunities for improvement in technical SEO, content, and user experience.",
    "li_seo_contenu_Mondial": "Optimizing and adapting meta tags, titles, and content to target relevant keywords in the two-wheeler industry.",
    "li_seo_vitesse_Mondial": "Improving page load speed to provide a better user experience and achieve higher search engine rankings.",
    "li_seo_analyse_Mondial": "Regularly tracking SEO performance using analytics tools to refine the strategy based on the results.",
    "li_title_sea_Mondial": "SEA Campaigns (Paid Advertising):",
    "li_sea_google_Mondial": "Creating and managing targeted Google Ads campaigns to boost site visibility and drive qualified traffic.",
    "li_sea_budget_Mondial": "Optimizing the advertising budget to maximize the return on investment (ROI) from the campaigns.",
    "li_sea_ciblage_Mondial": "Precisely targeting ads based on demographic, geographic, and interest-based criteria to reach potential customers.",
    "li_sea_reporting_Mondial": "Analyzing and reporting on SEA campaign performance to evaluate results and fine-tune advertising strategies."
}