{
    "button-lunch webside": "btn-l",
    "button_back": "Retour",
    "skills": "Compétences",
    "link_start": "Bienvenue",
    "link_about": "À propos de moi",
    "link_prestations": "Services",
    "link_project": "Projet",
    "link_skills": "Compétences",
    "link_testiomonials": "Témoignages",
    "link_contact": "Contact",
    "text_welcom": "Bienvenue !",
    "text_toMy": "sur mon",
    "porfolio": "site",
    "passionate": "passionnée, créative et à l'écoute",
    "web_developpeur": "Web Designer & Créatrice de sites web",
    "about": "À propos de moi",
    "my_name": "Je m'appelle Anna Stelmach",
    "desciptionTitle1_about": " Bonjour ! Je suis Anna.",
    "desciption1_about": "Passionnée par le développement web depuis 5 ans et dans le webmastering depuis des décennies, ancienne responsable dans le commerce de prêt-à-porter, j'ai franchi le cap pour vivre de ma passion : la création sur mesure de sites web e-commerce, de sites web vitrines et d'applications web.",
    "desciptionTitle2_about": " Expertise Certifiée, Service Personnalisé :",
    "desciption2_about": "Avec un diplôme de développeuse web certifié RNCP, je combine une expertise technique avec un service client exceptionnel. Chaque projet est traité avec dévouement et professionnalisme, vous assurant une solution sur mesure et de qualité.",
    "desciptionTitle3_about": " Vitrine ou E-commerce, Votre Succès en Ligne Débute Ici :",
    "desciption3_about": "Que vous souhaitiez présenter votre entreprise avec élégance ou vendre vos produits en ligne, je suis là pour concrétiser votre vision. Avec une expertise pointue dans le développement de sites vitrines et e-commerce, je vous aide à atteindre vos objectifs en ligne.",
    "desciptionTitle4_about": "📈 Un Site qui Évolue avec Vous :",
    "desciption4_about": "Votre site ne sera pas seulement un outil de marketing, mais un partenaire dans votre croissance. Avec des fonctionnalités évolutives et une architecture flexible, votre site sera prêt à évoluer avec votre entreprise.",
    "desciptionTitle5_about": " Une Expérience Utilisateur Mémorable :",
    "desciption5_about": "Je mets l'accent sur la convivialité et l'esthétique pour offrir à vos visiteurs une expérience fluide et engageante. Chaque élément de votre site sera soigneusement conçu pour captiver l'attention et encourager l'action.",
    "desciptionTitle6_about": " Optimisation SEO et Campagnes SEA :",
    "desciption6_about": "Je m'engage à maximiser votre visibilité en ligne à travers une optimisation SEO rigoureuse et des campagnes SEA ciblées. En utilisant les meilleures pratiques et les dernières techniques. Ensemble, nous développons une stratégie efficace pour améliorer votre présence en ligne et augmenter vos conversions.",
    "desciption7_about": "Contactez-moi dès aujourd'hui pour discuter de votre projet de site web ! Ensemble, nous pouvons créer une présence en ligne qui vous démarquera de la concurrence et séduira vos clients potentiels.",
    "desciptionTitle1_pousse": "Pour les projets plus poussés",
    "desciption1_pousse": "Je travaille en équipe avec le chef de projet et un développeur PHP (Symfony). Nous garantissons ainsi un résultat optimal et trouvons des solutions efficaces aux défis techniques et aux exigences du projet.",
    "prestations": "Services",
    "CV": "Téléchargez mon CV",
    "project": "Projets",
    "date1_project": "",
    "date2_project": "",
    "text_1": "J'adore cre.",
    "text_2": "Construire des rêves numériques, une ligne à la fois.",
    "text_3": "Je suis impatiente de mettre ma passion et ma détermination au service de la réussite de votre projet.",
    "contact_apelle": "Appelez-moi !",
    "chez_moi": "Chez moi",
    "text_motivation": "En tant que développeuse passionnée, mon objectif est de créer des solutions sur mesure qui non seulement répondent à vos besoins, mais qui dépassent également vos attentes. Avec une approche axée sur la collaboration et une passion pour l'innovation, je suis là pour vous accompagner dans chaque étape de votre projet. Ensemble, nous pouvons transformer vos idées en succès. Faisons équipe et créons quelque chose d'exceptionnel! Contactez-moi !",
    "title": "Backoffice pour l'application OneJitsu",
    "p1_onejitsu": "Actuellement engagé par le créateur de l'application Onjitsu, je travaille en solo sur la création du backoffice en mode bureau de l'application. En raison de la confidentialité, des détails spécifiques ne peuvent pas être divulgués, mais je suis passionné par ce défi significatif.",
    "p2_onejitsu": "Cette mission consiste à permettre aux gestionnaires de clubs de gérer efficacement leurs clubs, les profils de leurs membres, de créer des événements, des cours et des actualités, ainsi que de modifier les coordonnées et les horaires. L'interface permet également d'interagir avec le nombre de clubs.",
    "p3_onejitsu": "Le backend de l'application est naturellement géré par Firestore.",
    "title_quiAntique": "Restaurant Quai Antique",
    "p1_quaiAntique": "Ce projet a été un<span class=\"fw-bolder text-fort\"> défi</span> significatif pour moi, réalisé dans le cadre de mon examen final pour obtenir le diplôme de développeur web. Il s'agit d'une application complète avec des interfaces <span class=\"fw-bolder text-fort\">frontend et backend</span>, accompagnée d'un<span class=\"fw-bolder text-fort\"> backoffice administrateur</span>. J'y ai consacré cinq mois pour le terminer, et ce projet m'a fourni un aperçu concret du métier de développeur.",
    "p2_quaiAntique": "Pour sa réalisation, j'ai choisi d'utiliser <span class=\"fw-bolder text-fort\">React.js et Node.js</span>, car ce sont les technologies que je maîtrisais le mieux. J'ai commencé par concevoir <span class=\"fw-bolder text-fort\">toutes les interfaces</span>, tant pour <span class=\"fw-bolder text-fort\">le bureau que pour le mobile, en utilisant Figma</span>, me permettant de visualiser mon site. Ensuite, j'ai créé des <span class=\"fw-bolder text-fort\">diagrammes de cas d'utilisation et un modèle de données conceptuel (MDC)</span> pour comprendre et définir la base de données et les fonctionnalités du site.",
    "p3_quaiAntique": "Le développement a commencé par la création d'un <span class=\"fw-bolder text-fort\">composant communiquant avec ma base de données via des requêtes SQL</span>. J'ai développé mon <span class=\"fw-bolder text-fort\">API RESTful avec Express.js</span> et le <span class=\"fw-bolder text-fort\">frontend basé sur mes maquettes</span>.<br> <span class=\"text-decoration-underline\">L'aspect visuel de ce projet a été relégué au second plan par rapport aux fonctionnalités qu'il offrait.</span>",
    "p4_quaiAntique": "Les utilisateurs peuvent <span class=\"fw-bolder text-fort\">s'inscrire, se connecter, réserver une table et l'administrateur, via le backoffice, peut modifier pratiquement tout sur le site</span>. Bien que ce projet ait présenté un <span class=\"fw-bolder text-fort\">défi</span> considérable, il a été très <span class=\"fw-bolder text-fort\">éducatif</span>. Il a également suscité un engagement envers l'amélioration continue et la prise de conscience qu'il <span class=\"fw-bolder text-fort\">y a encore beaucoup à apprendre</span> et à perfectionner dans mon parcours en tant que développeur. Je continue à l'améliorer, car il y a encore beaucoup à faire.",
    "title_coeur": "Association Cœur sur la main",
    "p1_coeur": "Il s'agit de mon tout premier projet de site web que j'ai commencé en octobre 2022 et qui m'a pris un mois pour le terminer.",
    "p2_coeur": "C'était un projet front-end réalisé dans le cadre d'une mission individuelle pendant mes études à Studi. Avec du recul, je réalise à quel point il est basique, mais vous savez ce qu'on dit - n'oubliez jamais vos débuts ! <br>pour se rappeler d'où l'on vient !",
    "p3_coeur": "Ce projet me permet de prendre conscience des progrès que j'ai réalisés en peu de temps dans le domaine de la programmation.",
    "title_Sama": "Site web pour naturopathie",
    "p1_Sama": "J'ai été en charge de la création et du développement d’un site web pour une naturopathe.",
    "p2_Sama": "L'objectif principal était de créer une plateforme qui reflétait fidèlement ses valeurs, ses goûts personnels et son approche unique de la santé naturelle.",
    "p3_Sama": "Chaque élément du site a été conçu pour être à son image, car c’était cela qui était le plus important : offrir une expérience en ligne qui soit en harmonie avec sa philosophie et sa pratique.",
    "title_Built": "Site pour Built Assets",
    "p1_Built": "J'ai été engagée par l'entreprise Built Assets, une grande entreprise dynamique spécialisée dans les secteurs de la construction, du conseil, de l'immobilier et des solutions énergétiques au Togo. Travaillant en étroite collaboration avec eux, j'ai mis à profit mes compétences et mon expertise pour concevoir ce projet de A à Z, entièrement sur mesure. Le défi était de bien construire le site pour mettre en valeur leurs nombreux services et leurs clients prestigieux.",
    "li_title_projet": "Objectif du Projet :",
    "li_concevoir": "Concevoir et développer un site web professionnel pour Built Assets afin de promouvoir ses services et renforcer sa présence en ligne.",
    "li_title_portee": "Portée du Projet :",
    "li_portee_creation": "Création d'un site web responsive et esthétique qui mettra en valeur les domaines d'expertise de Built Assets, y compris la construction, le conseil, l'immobilier et les solutions énergétiques.",
    "li_portee_integration": "Intégration de fonctionnalités interactives pour offrir une expérience utilisateur optimale.",
    "li_portee_optimisation": "Optimisation du site pour les moteurs de recherche (SEO) afin d'augmenter sa visibilité en ligne et d'attirer plus de clients potentiels.",
    "li_portee_colaboration": "Collaboration étroite avec le fondateur de Built Assets pour s'assurer que le site reflète fidèlement l'image de l'entreprise et répond à ses besoins spécifiques.",
    "li_title_etapes": "Étapes du Projet :",
    "li_etapes_p1": "Analyse des besoins et des objectifs de l'entreprise, définition des fonctionnalités et de l'architecture du site.",
    "li_etapes_p2": "Conception graphique et création de maquettes pour approbation.",
    "li_etapes_p3": "Développement du site web en utilisant les meilleures pratiques en matière de développement web et de design.",
    "li_etapes_p4": "Intégration de contenu, tests et validation avec l'équipe de Built Assets.",
    "li_etapes_p5": "Déploiement du site web et formation pour l'administration et la gestion du contenu.",
    "li_title_echeance": "Échéancier :",
    "li_echeance": "Durée du projet : 3 mois",
    "li_title_livrables": "Livraibles :",
    "li_livrables_functionnel": "Site web entièrement fonctionnel et optimisé",
    "li_livrables_formation": "Formation pour l'équipe de Built Assets sur la gestion du site web",
    "title_Mondial": "Site pour Mondial 2 Roues",
    "p1_Mondial": "J'ai été engagée par Mondial 2 Roues, anciennement connue sous le nom de Mondial City, un leader dans la vente et la réparation de motos et scooters. Travaillant en étroite collaboration avec les deux propriétaires de l'entreprise, j'ai conçu et développé un site web moderne et efficace pour mettre en valeur leur large gamme de produits et services. L'objectif principal était de créer une plateforme intuitive qui attire les passionnés de deux-roues tout en offrant une expérience d'achat fluide et agréable.",
    "li_title_projet_Mondial": "Objectif du Projet :",
    "li_concevoir_Mondial": "Concevoir et développer un site web professionnel pour Mondial 2 Roues afin de promouvoir leurs produits et services tout en renforçant leur présence en ligne.",
    "li_title_portee_Mondial": "Portée du Projet :",
    "li_portee_creation_Mondial": "Création d'un site web responsive, attrayant et facile à naviguer, mettant en avant la gamme de motos, scooters et accessoires disponibles chez Mondial 2 Roues.",
    "li_portee_integration_Mondial": "Intégration d'une fonctionnalité de catalogue produit avec des options de filtre pour améliorer l'expérience utilisateur.",
    "li_portee_optimisation_Mondial": "Optimisation du site pour les moteurs de recherche (SEO) afin d'augmenter sa visibilité en ligne et d'attirer plus de clients potentiels.",
    "li_portee_colaboration_Mondial": "Collaboration étroite avec les propriétaires de Mondial 2 Roues pour s'assurer que le site reflète fidèlement leur image de marque et répond à leurs besoins spécifiques.",
    "li_title_etapes_Mondial": "Étapes du Projet :",
    "li_etapes_p1_Mondial": "Analyse des besoins de l'entreprise et définition des fonctionnalités nécessaires pour le site.",
    "li_etapes_p2_Mondial": "Conception graphique et élaboration de maquettes, avec un focus sur l'expérience utilisateur et l'esthétique.",
    "li_etapes_p3_Mondial": "Développement du site web en utilisant les meilleures pratiques en matière de développement web. et d'UX/UI design.",
    "li_etapes_p4_Mondial": "Intégration du catalogue produit, des services, et tests rigoureux pour assurer une expérience fluide sur tous les appareils.",
    "li_etapes_p5_Mondial": "Déploiement du site web et formation des propriétaires de Mondial 2 Roues sur l'administration et la gestion du contenu.",
    "li_title_echeance_Mondial": "Échéancier :",
    "li_echeance_Mondial": "Durée du projet : 2 mois",
    "li_title_livrables_Mondial": "Livrables :",
    "li_livrables_functionnel_Mondial": "Site web entièrement fonctionnel, optimisé et prêt pour le commerce en ligne.",
    "li_livrables_formation_Mondial": "Formation pour les propriétaires de Mondial 2 Roues sur la gestion du site web et l'ajout de nouveaux produits.",
    "li_title_collaboration_Mondial": "Collaboration Continue :",
    "title_seo_sea_Mondial": "Optimisation SEO Poussée et Campagnes SEA pour Mondial 2 Roues",
    "p1_seo_sea_Mondial": "Après la création du site web, j'ai été engagée pour poursuivre l'optimisation SEO et mettre en place des campagnes publicitaires SEA (Search Engine Advertising) afin de renforcer la visibilité en ligne de Mondial 2 Roues et d'attirer davantage de clients potentiels.",
    "li_title_seo_Mondial": "Optimisation SEO Poussée :",
    "li_seo_audit_Mondial": "Identifier les opportunités d'amélioration en termes de SEO technique, de contenu et d'expérience utilisateur.",
    "li_seo_contenu_Mondial" : "Optimisation et adaptation des balises méta, des titres et du contenu pour cibler les mots-clés pertinents dans le domaine des deux-roues.",   
    "li_seo_vitesse_Mondial": "Amélioration de la vitesse de chargement des pages pour offrir une meilleure expérience utilisateur et obtenir un meilleur classement dans les moteurs de recherche.",
    "li_seo_analyse_Mondial": "Suivi régulier des performances SEO à l'aide d'outils d'analyse pour ajuster la stratégie en fonction des résultats obtenus.",
    "li_title_sea_Mondial": "Campagnes SEA (Publicités Payantes) :",
    "li_sea_google_Mondial": "Création et gestion de campagnes Google Ads ciblées pour augmenter la visibilité du site et générer du trafic qualifié.",
    "li_sea_budget_Mondial": "Optimisation du budget publicitaire pour maximiser le retour sur investissement (ROI) des campagnes.",
    "li_sea_ciblage_Mondial": "Ciblage précis des annonces en fonction des critères démographiques, géographiques et d'intérêts des clients potentiels.",
    "li_sea_reporting_Mondial": "Analyse et reporting des performances des campagnes SEA pour évaluer les résultats et affiner les stratégies publicitaires."
}